"""
1 Задавание информации о школе:
    название школы
    адрес школы
2 Меню программы, в котором есть следующие пункты:
    Получение полной информации о школе:
        Название
        Адрес
        Количество учеников, которые учатся в данной школе
    Изменение информации о школе
        название школы
        адрес школы
    Просмотр учеников школы в виде таблицы
        Номер ученика. Нумерация начинается с 1
        ФИО ученика
        Возраст
        Номер класса

    Добавление нового ученика школы

    Удаление имеющегося ученика школы

"""
